---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.RevitServerUnauthorizedException
source: html/034b6836-ff77-41ec-e442-fe3ea3cce369.htm
---
# RevitServerUnauthorizedException Methods

Retrieves data needed to serialize the target object.